gswdh/CameraElectronics/camera.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32H7
PC3.Mode=Host_HS
RCC.DIVQ2Freq_Value=129000000
ProjectManager.MainLocation=Core/Src
PB13.GPIOParameters=PinAttribute
USB_HOST_M7.USBH_HandleTypeDef-MSC_HS=hUsbHostHS
RCC.SAI1Freq_Value=129000000
RCC.CortexFreq_Value=64000000
PB10.PinAttribute=CortexM7
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H745XIHx
PB10.Mode=Host_HS
NVIC2.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.functionlistsort=
PC0.GPIOParameters=PinAttribute
USB_HOST_M7.VirtualModeHS=Msc
RCC.CPU2Freq_Value=64000000
RCC.RTCFreq_Value=32000
USB_HOST_M7.IPParameters=USBH_HandleTypeDef-MSC_HS,VirtualModeHS
PA5.PinAttribute=CortexM7
PA3.GPIOParameters=PinAttribute
RCC.VCO2OutputFreq_Value=258000000
RCC.CpuClockFreq_Value=64000000
PB11.Signal=USB_OTG_HS_ULPI_D4
PB13.Signal=USB_OTG_HS_ULPI_D6
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=64000000
ProjectManager.StackSize=0x400
PB5.GPIOParameters=PinAttribute
RCC.AHB4Freq_Value=64000000
USB_OTG_HS.VirtualMode-Host_HS=Host_HS
PI11.GPIOParameters=PinAttribute
RCC.VCOInput3Freq_Value=2000000
RCC.LPTIM1Freq_Value=64000000
Mcu.IP4=NVIC2
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP5=RCC
Mcu.IP2=FATFS_M7
Mcu.IP3=NVIC1
PB11.PinAttribute=CortexM7
PI11.Mode=Host_HS
Mcu.IP0=CORTEX_M4
Mcu.IP1=CORTEX_M7
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.UserConstants=
RCC.DIVP3Freq_Value=129000000
RCC.SDMMCFreq_Value=129000000
NVIC1.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PI11.PinAttribute=CortexM7
Mcu.ThirdPartyNb=0
USB_OTG_HS.dma_enable-Host_HS=ENABLE
RCC.HCLKFreq_Value=64000000
RCC.I2C4Freq_Value=64000000
Mcu.IPNb=10
ProjectManager.PreviousToolchain=
RCC.SPDIFRXFreq_Value=129000000
PC0.PinAttribute=CortexM7
RCC.DIVQ3Freq_Value=129000000
PC3.Signal=USB_OTG_HS_ULPI_NXT
Mcu.Pin6=PA5
Mcu.Pin7=PB1
Mcu.Pin8=PB12
Mcu.Pin9=PA3
Mcu.Pin0=PB5
Mcu.Pin1=PI11
NVIC1.OTG_HS_EP1_OUT_IRQn=true\:0\:0\:false\:false\:true\:true\:true
GPIO.groupedBy=
Mcu.Pin2=PC0
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.HRTIMFreq_Value=64000000
Mcu.Pin3=PC3
Mcu.Pin4=PB10
PB0.PinAttribute=CortexM7
Mcu.Pin5=PB11
ProjectManager.ProjectBuild=false
RCC.DIVR3Freq_Value=129000000
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB12.PinAttribute=CortexM7
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.8.0
MxDb.Version=DB.6.0.0
PB0.GPIOParameters=PinAttribute
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
RCC.DIVP1Freq_Value=129000000
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=64000000
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB5.Mode=Host_HS
RCC.USART16Freq_Value=64000000
File.Version=6
VP_SYS_M4_VS_Systick.Mode=SysTick
NVIC1.OTG_HS_EP1_IN_IRQn=true\:0\:0\:false\:false\:true\:true\:true
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USB_OTG_HS.IPParameters=VirtualMode-Host_HS,dma_enable-Host_HS
CortexM7.IPs=CORTEX_M7\:I,DEBUG\:I,FATFS_M7\:I,FREERTOS_M7\:I,IWDG1\:I,OPENAMP_M7\:I,PDM2PCM_M7\:I,PWR\:I,RCC\:I,RESMGR_UTILITY\:I,SYS\:I,USB_DEVICE_M7\:I,USB_HOST_M7\:I,VREFBUF\:I,WWDG1\:I,DMA\:I,BDMA\:I,MDMA\:I,NVIC1\:I,USB_OTG_HS\:I
RCC.DIVR2Freq_Value=129000000
PA3.PinAttribute=CortexM7
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=129000000
ProjectManager.ProjectName=camera
RCC.APB3Freq_Value=64000000
RCC.MCO2PinFreq_Value=64000000
Mcu.Package=TFBGA240
PB1.Signal=USB_OTG_HS_ULPI_D2
PB12.Mode=Host_HS
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.DIVR1Freq_Value=129000000
RCC.DFSDMFreq_Value=64000000
PA5.GPIOParameters=PinAttribute
Mcu.Context0=CortexM7
Mcu.Context1=CortexM4
VP_USB_HOST_M7_VS_USB_HOST_MSC_HS.Mode=MSC_HS
RCC.TraceFreq_Value=64000000
RCC.APB4Freq_Value=64000000
PC3.PinAttribute=CortexM7
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=129000000
RCC.LPUART1Freq_Value=64000000
PB10.GPIOParameters=PinAttribute
PB13.Mode=Host_HS
PI11.Signal=USB_OTG_HS_ULPI_DIR
ProjectManager.CustomerFirmwarePackage=
RCC.Tim2OutputFreq_Value=64000000
RCC.DFSDMACLkFreq_Value=129000000
RCC.VCO3OutputFreq_Value=258000000
PA3.Signal=USB_OTG_HS_ULPI_D0
PA5.Mode=Host_HS
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.ProjectFileName=camera.ioc
VP_FATFS_M7_VS_USB.Mode=USB
Mcu.PinsNb=16
VP_USB_HOST_M7_VS_USB_HOST_MSC_HS.Signal=USB_HOST_M7_VS_USB_HOST_MSC_HS
ProjectManager.NoMain=false
RCC.SWPMI1Freq_Value=64000000
RCC.SAI4BFreq_Value=129000000
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
PC0.Signal=USB_OTG_HS_ULPI_STP
RCC.QSPIFreq_Value=64000000
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
PC0.Mode=Host_HS
PB13.PinAttribute=CortexM7
RCC.SPI6Freq_Value=64000000
PC3.GPIOParameters=PinAttribute
RCC.D1CPREFreq_Value=64000000
PA3.Mode=Host_HS
RCC.USART234578Freq_Value=64000000
RCC.Tim1OutputFreq_Value=64000000
RCC.SPI45Freq_Value=64000000
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.SPI123Freq_Value=129000000
PB11.Mode=Host_HS
ProjectManager.TargetToolchain=EWARM V8.32
RCC.VCO1OutputFreq_Value=258000000
NVIC2.ForceEnableDMAVector=true
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.AXIClockFreq_Value=64000000
NVIC1.ForceEnableDMAVector=true
PB11.GPIOParameters=PinAttribute
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=129000000
RCC.CKPERFreq_Value=64000000
PB10.Signal=USB_OTG_HS_ULPI_D3
ProjectManager.BootMode=boot0
PA5.Signal=USB_OTG_HS_ULPI_CK
PB0.Mode=Host_HS
board=custom
ProjectManager.LastFirmware=true
PB5.PinAttribute=CortexM7
RCC.VCOInput1Freq_Value=2000000
PB1.PinAttribute=CortexM7
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.AHB12Freq_Value=64000000
RCC.APB2Freq_Value=64000000
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
MxCube.Version=6.0.1
RCC.FDCANFreq_Value=129000000
RCC.RNGFreq_Value=48000000
RCC.ADCFreq_Value=129000000
VP_SYS_VS_Systick.Mode=SysTick
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CPU2Freq_Value,CPU2SystikFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HRTIMFreq_Value,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H745XIHx
RCC.LPTIM2Freq_Value=64000000
ProjectManager.UnderRoot=false
Mcu.IP8=USB_HOST_M7
Mcu.IP9=USB_OTG_HS
Mcu.IP6=SYS
Mcu.IP7=SYS_M4
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=64000000
VP_SYS_M4_VS_Systick.Signal=SYS_M4_VS_Systick
PB5.Signal=USB_OTG_HS_ULPI_D7
RCC.I2C123Freq_Value=64000000
KeepUserPlacement=false
ProjectManager.CompilerOptimize=6
ProjectManager.HeapSize=0x200
Mcu.Pin15=VP_USB_HOST_M7_VS_USB_HOST_MSC_HS
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB1.Mode=Host_HS
Mcu.Pin13=VP_SYS_VS_Systick
Mcu.Pin14=VP_SYS_M4_VS_Systick
RCC.LPTIM345Freq_Value=64000000
ProjectManager.ComputerToolchain=false
RCC.LTDCFreq_Value=129000000
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.SAI4AFreq_Value=129000000
Mcu.Pin11=PB13
Mcu.Pin12=VP_FATFS_M7_VS_USB
Mcu.Pin10=PB0
RCC.DIVQ1Freq_Value=129000000
NVIC1.OTG_HS_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.HCLK3ClockFreq_Value=64000000
RCC.VCOInput2Freq_Value=2000000
RCC.APB1Freq_Value=64000000
VP_FATFS_M7_VS_USB.Signal=FATFS_M7_VS_USB
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB0.Signal=USB_OTG_HS_ULPI_D1
Mcu.ContextNb=2
RCC.CPU2SystikFreq_Value=64000000
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeviceId=STM32H745XIHx
PB12.GPIOParameters=PinAttribute
PB12.Signal=USB_OTG_HS_ULPI_D5
ProjectManager.LibraryCopy=0
PB1.GPIOParameters=PinAttribute
CortexM4.IPs=CORTEX_M4\:I,DEBUG,FATFS_M4\:I,FREERTOS_M4\:I,IWDG2\:I,OPENAMP_M4\:I,PDM2PCM_M4\:I,PWR,RCC,RESMGR_UTILITY,SYS_M4\:I,USB_DEVICE_M4\:I,USB_HOST_M4\:I,VREFBUF,WWDG2\:I,DMA,BDMA,MDMA,NVIC2\:I
